Repository: hinname/backlog-clear
Catalog: backend/src/BacklogClear.Exception/Resources/ResourceErrorMessages.*.resx
Languages: pt_br

# GENRE_REQUIRED
source: Genre is required.
pt_br: O gênero é obrigatório.

# PLATFORM_REQUIRED
source: Platform is required.
pt_br: A plataforma é obrigatória.

# RELEASE_DATE_MUST_BE_IN_PAST
source: Release date must be in the past.
pt_br: A data de lançamento precisa estar no passado.

# STATUS_INVALID
source: Status is invalid.
pt_br: Status inválido.

# TITLE_REQUIRED
source: Title is required.
pt_br: O título é obrigatório.

source: Unknown error.
pt_br: Erro desconhecido.

source: Game not found.
pt_br: Jogo não encontrado.

# START_DATE_NOT_ALLOWED
source: Start playing date cannot be setted in a game with "backlog"status.
pt_br: A data início da jogatina não pode ser preenchida em jogo com status "backlog".

# END_DATE_NOT_ALLOWED
source: End playing date cannot be setted for a game that is not in "completed" status.
pt_br: A data de término da jogatina não pode ser preenchida em um jogo fora do status "finalizado".

# START_DATE_MUST_BE_IN_PAST
source: Start playing date must be in the past.
pt_br: A data de início da jogatina deve estar no passado.

# END_DATE_MUST_BE_IN_PAST
source: End played date must be in past.
pt_br: A data de término da jogatina precisa estar no passado.

# USER_NAME_REQUIRED
source: Name is required.
pt_br: O nome é obrigatório.

# USER_EMAIL_REQUIRED
source: E-mail is required.
pt_br: O e-mail é obrigatório.

# USER_PASSWORD_REQUIRED
source: Password is required.
pt_br: A senha é obrigatória.

# USER_PASSWORD_INVALID
source: Password invalid. Must contain at least 8 characters with letters, numbers and special symbols.
pt_br: Senha inválida. Deve conter no mínimo 8 caracteres com letras, números e simbolos especiais.

# USER_EMAIL_INVALID
source: E-mail is invalid.
pt_br: E-mail inválido.

# USER_EMAIL_ALREADY_REGISTERED
source: E-mail already exists.
pt_br: Esse e-mail já está sendo usado.
